MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA2T1073CNK/mcu.h
 #define R_SYSTEM_DPFSAR_DPFSA13_Msk               (0x2000UL)     /*!< DPFSA13 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA14_Pos               (14UL)         /*!< DPFSA14 (Bit 14)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA14_Msk               (0x4000UL)     /*!< DPFSA14 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA15_Pos               (15UL)         /*!< DPFSA15 (Bit 15)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA15_Msk               (0x8000UL)     /*!< DPFSA15 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA16_Pos               (16UL)         /*!< DPFSA16 (Bit 16)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA16_Msk               (0x10000UL)    /*!< DPFSA16 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA17_Pos               (17UL)         /*!< DPFSA17 (Bit 17)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA17_Msk               (0x20000UL)    /*!< DPFSA17 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA18_Pos               (18UL)         /*!< DPFSA18 (Bit 18)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA18_Msk               (0x40000UL)    /*!< DPFSA18 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA19_Pos               (19UL)         /*!< DPFSA19 (Bit 19)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA19_Msk               (0x80000UL)    /*!< DPFSA19 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA20_Pos               (20UL)         /*!< DPFSA20 (Bit 20)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA20_Msk               (0x100000UL)   /*!< DPFSA20 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA24_Pos               (24UL)         /*!< DPFSA24 (Bit 24)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA24_Msk               (0x1000000UL)  /*!< DPFSA24 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA26_Pos               (26UL)         /*!< DPFSA26 (Bit 26)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA26_Msk               (0x4000000UL)  /*!< DPFSA26 (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_DPFSAR_DPFSA27_Pos               (27UL)         /*!< DPFSA27 (Bit 27)                                      */
 #define R_SYSTEM_DPFSAR_DPFSA27_Msk               (0x8000000UL)  /*!< DPFSA27 (Bitfield-Mask: 0x01)                         */
/* ========================================================  DPSWCR  ========================================================= */
 #define R_SYSTEM_DPSWCR_WTSTS_Pos                 (0UL)          /*!< WTSTS (Bit 0)                                         */
 #define R_SYSTEM_DPSWCR_WTSTS_Msk                 (0x3fUL)       /*!< WTSTS (Bitfield-Mask: 0x3f)                           */
/* ======================================================  VBATTMNSELR  ====================================================== */
 #define R_SYSTEM_VBATTMNSELR_VBATTMNSEL_Pos       (0UL)          /*!< VBATTMNSEL (Bit 0)                                    */
 #define R_SYSTEM_VBATTMNSELR_VBATTMNSEL_Msk       (0x1UL)        /*!< VBATTMNSEL (Bitfield-Mask: 0x01)                      */
/* =======================================================  VBATTMONR  ======================================================= */
 #define R_SYSTEM_VBATTMONR_VBATTMON_Pos           (0UL)          /*!< VBATTMON (Bit 0)                                      */
 #define R_SYSTEM_VBATTMONR_VBATTMON_Msk           (0x1UL)        /*!< VBATTMON (Bitfield-Mask: 0x01)                        */
/* ========================================================  VBTBER  ========================================================= */
 #define R_SYSTEM_VBTBER_VBAE_Pos                  (3UL)          /*!< VBAE (Bit 3)                                          */
 #define R_SYSTEM_VBTBER_VBAE_Msk                  (0x8UL)        /*!< VBAE (Bitfield-Mask: 0x01)                            */

/* =========================================================================================================================== */
/* ================                                           R_TSN                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  TSCDR  ========================================================= */
/* ========================================================  TSCDRH  ========================================================= */
 #define R_TSN_TSCDRH_TSCDRH_Pos    (0UL)    /*!< TSCDRH (Bit 0)                                        */
 #define R_TSN_TSCDRH_TSCDRH_Msk    (0xffUL) /*!< TSCDRH (Bitfield-Mask: 0xff)                          */
/* ========================================================  TSCDRL  ========================================================= */
 #define R_TSN_TSCDRL_TSCDRL_Pos    (0UL)    /*!< TSCDRL (Bit 0)                                        */
 #define R_TSN_TSCDRL_TSCDRL_Msk    (0xffUL) /*!< TSCDRL (Bitfield-Mask: 0xff)                          */
/* ========================================================  TSCDRR  ========================================================= */

/* =========================================================================================================================== */
/* ================                                           R_WDT                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  WDTRR  ========================================================= */
 #define R_WDT_WDTRR_WDTRR_Pos        (0UL)      /*!< WDTRR (Bit 0)                                         */
 #define R_WDT_WDTRR_WDTRR_Msk        (0xffUL)   /*!< WDTRR (Bitfield-Mask: 0xff)                           */
/* =========================================================  WDTCR  ========================================================= */
 #define R_WDT_WDTCR_RPSS_Pos         (12UL)     /*!< RPSS (Bit 12)                                         */
 #define R_WDT_WDTCR_RPSS_Msk         (0x3000UL) /*!< RPSS (Bitfield-Mask: 0x03)                            */
 #define R_WDT_WDTCR_RPES_Pos         (8UL)      /*!< RPES (Bit 8)                                          */
 #define R_WDT_WDTCR_RPES_Msk         (0x300UL)  /*!< RPES (Bitfield-Mask: 0x03)                            */
 #define R_WDT_WDTCR_CKS_Pos          (4UL)      /*!< CKS (Bit 4)                                           */
 #define R_WDT_WDTCR_CKS_Msk          (0xf0UL)   /*!< CKS (Bitfield-Mask: 0x0f)                             */
 #define R_WDT_WDTCR_TOPS_Pos         (0UL)      /*!< TOPS (Bit 0)                                          */
 #define R_WDT_WDTCR_TOPS_Msk         (0x3UL)    /*!< TOPS (Bitfield-Mask: 0x03)                            */
/* =========================================================  WDTSR  ========================================================= */
 #define R_WDT_WDTSR_REFEF_Pos        (15UL)     /*!< REFEF (Bit 15)                                        */
 #define R_WDT_WDTSR_REFEF_Msk        (0x8000UL) /*!< REFEF (Bitfield-Mask: 0x01)                           */
 #define R_WDT_WDTSR_UNDFF_Pos        (14UL)     /*!< UNDFF (Bit 14)                                        */
 #define R_WDT_WDTSR_UNDFF_Msk        (0x4000UL) /*!< UNDFF (Bitfield-Mask: 0x01)                           */
 #define R_WDT_WDTSR_CNTVAL_Pos       (0UL)      /*!< CNTVAL (Bit 0)                                        */
 #define R_WDT_WDTSR_CNTVAL_Msk       (0x3fffUL) /*!< CNTVAL (Bitfield-Mask: 0x3fff)                        */
/* ========================================================  WDTRCR  ========================================================= */
 #define R_WDT_WDTRCR_RSTIRQS_Pos     (7UL)      /*!< RSTIRQS (Bit 7)                                       */
 #define R_WDT_WDTRCR_RSTIRQS_Msk     (0x80UL)   /*!< RSTIRQS (Bitfield-Mask: 0x01)                         */
/* =======================================================  WDTCSTPR  ======================================================== */
 #define R_WDT_WDTCSTPR_SLCSTP_Pos    (7UL)      /*!< SLCSTP (Bit 7)                                        */
 #define R_WDT_WDTCSTPR_SLCSTP_Msk    (0x80UL)   /*!< SLCSTP (Bitfield-Mask: 0x01)                          */

/* =========================================================================================================================== */
/* ================                                        R_ACMPHS_B                                         ================ */
/* =========================================================================================================================== */

/* =======================================================  COMPMDR0  ======================================================== */
 #define R_ACMPHS_B_COMPMDR0_C1MON_Pos    (7UL)    /*!< C1MON (Bit 7)                                         */
 #define R_ACMPHS_B_COMPMDR0_C1MON_Msk    (0x80UL) /*!< C1MON (Bitfield-Mask: 0x01)                           */
 #define R_ACMPHS_B_COMPMDR0_C1POE_Pos    (5UL)    /*!< C1POE (Bit 5)                                         */
 #define R_ACMPHS_B_COMPMDR0_C1POE_Msk    (0x20UL) /*!< C1POE (Bitfield-Mask: 0x01)                           */
 #define R_ACMPHS_B_COMPMDR0_C1ENB_Pos    (4UL)    /*!< C1ENB (Bit 4)                                         */
 #define R_ACMPHS_B_COMPMDR0_C1ENB_Msk    (0x10UL) /*!< C1ENB (Bitfield-Mask: 0x01)                           */
 #define R_ACMPHS_B_COMPMDR0_C0MON_Pos    (3UL)    /*!< C0MON (Bit 3)                                         */
 #define R_ACMPHS_B_COMPMDR0_C0MON_Msk    (0x8UL)  /*!< C0MON (Bitfield-Mask: 0x01)                           */
 #define R_ACMPHS_B_COMPMDR0_C0POE_Pos    (1UL)    /*!< C0POE (Bit 1)                                         */
 #define R_ACMPHS_B_COMPMDR0_C0POE_Msk    (0x2UL)  /*!< C0POE (Bitfield-Mask: 0x01)                           */
 #define R_ACMPHS_B_COMPMDR0_C0ENB_Pos    (0UL)    /*!< C0ENB (Bit 0)                                         */
 #define R_ACMPHS_B_COMPMDR0_C0ENB_Msk    (0x1UL)  /*!< C0ENB (Bitfield-Mask: 0x01)                           */
/* ========================================================  CMP0SEL  ======================================================== */
 #define R_ACMPHS_B_CMP0SEL_C0REFS_Pos    (0UL)    /*!< C0REFS (Bit 0)                                        */
 #define R_ACMPHS_B_CMP0SEL_C0REFS_Msk    (0x7UL)  /*!< C0REFS (Bitfield-Mask: 0x07)                          */
 #define R_ACMPHS_B_CMP0SEL_C0INS_Pos     (6UL)    /*!< C0INS (Bit 6)                                         */
 #define R_ACMPHS_B_CMP0SEL_C0INS_Msk     (0xc0UL) /*!< C0INS (Bitfield-Mask: 0x03)                           */
/* ========================================================  CMP1SEL  ======================================================== */
 #define R_ACMPHS_B_CMP1SEL_C1REFS_Pos    (0UL)    /*!< C1REFS (Bit 0)                                        */
 #define R_ACMPHS_B_CMP1SEL_C1REFS_Msk    (0x3UL)  /*!< C1REFS (Bitfield-Mask: 0x03)                          */
/* =======================================================  COMPFIR0  ======================================================== */
 #define R_ACMPHS_B_COMPFIR0_C0FCK_Pos    (0UL)    /*!< C0FCK (Bit 0)                                         */
 #define R_ACMPHS_B_COMPFIR0_C0FCK_Msk    (0x3UL)  /*!< C0FCK (Bitfield-Mask: 0x03)                           */
 #define R_ACMPHS_B_COMPFIR0_C0EPO_Pos    (2UL)    /*!< C0EPO (Bit 2)                                         */
 #define R_ACMPHS_B_COMPFIR0_C0EPO_Msk    (0x4UL)  /*!< C0EPO (Bitfield-Mask: 0x01)                           */
 #define R_ACMPHS_B_COMPFIR0_C0EDG_Pos    (3UL)    /*!< C0EDG (Bit 3)                                         */
 #define R_ACMPHS_B_COMPFIR0_C0EDG_Msk    (0x8UL)  /*!< C0EDG (Bitfield-Mask: 0x01)                           */
 #define R_ACMPHS_B_COMPFIR0_C1FCK_Pos    (4UL)    /*!< C1FCK (Bit 4)                                         */
 #define R_ACMPHS_B_COMPFIR0_C1FCK_Msk    (0x30UL) /*!< C1FCK (Bitfield-Mask: 0x03)                           */
 #define R_ACMPHS_B_COMPFIR0_C1EPO_Pos    (6UL)    /*!< C1EPO (Bit 6)                                         */
 #define R_ACMPHS_B_COMPFIR0_C1EPO_Msk    (0x40UL) /*!< C1EPO (Bitfield-Mask: 0x01)                           */
 #define R_ACMPHS_B_COMPFIR0_C1EDG_Pos    (7UL)    /*!< C1EDG (Bit 7)                                         */
 #define R_ACMPHS_B_COMPFIR0_C1EDG_Msk    (0x80UL) /*!< C1EDG (Bitfield-Mask: 0x01)                           */
/* =======================================================  COMPOCR0  ======================================================== */
 #define R_ACMPHS_B_COMPOCR0_C0OE_Pos     (1UL)    /*!< C0OE (Bit 1)                                          */
 #define R_ACMPHS_B_COMPOCR0_C0OE_Msk     (0x2UL)  /*!< C0OE (Bitfield-Mask: 0x01)                            */
 #define R_ACMPHS_B_COMPOCR0_C0OP_Pos     (2UL)    /*!< C0OP (Bit 2)                                          */
 #define R_ACMPHS_B_COMPOCR0_C0OP_Msk     (0x4UL)  /*!< C0OP (Bitfield-Mask: 0x01)                            */
 #define R_ACMPHS_B_COMPOCR0_C1OE_Pos     (5UL)    /*!< C1OE (Bit 5)                                          */
 #define R_ACMPHS_B_COMPOCR0_C1OE_Msk     (0x20UL) /*!< C1OE (Bitfield-Mask: 0x01)                            */
 #define R_ACMPHS_B_COMPOCR0_C1OP_Pos     (6UL)    /*!< C1OP (Bit 6)                                          */
 #define R_ACMPHS_B_COMPOCR0_C1OP_Msk     (0x40UL) /*!< C1OP (Bitfield-Mask: 0x01)                            */

/* =========================================================================================================================== */
/* ================                                          R_AGTX0                                          ================ */
/* =========================================================================================================================== */

/** @} */ /* End of group PosMask_peripherals */

 #ifdef __cplusplus
}
 #endif

#endif                                 /* R7FA2T107_H */

/** @} */ /* End of group R7FA2T107 */

/** @} */ /* End of group Renesas Electronics Corporation */
